bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиНастройкиПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтарыеЗаписи.Период КАК Период,
	|	СтарыеЗаписи.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	СтарыеЗаписи.ОбъектСистемы КАК ОбъектСистемы,
	|	СтарыеЗаписи.Приоритет КАК Приоритет,
	|	СтарыеЗаписи.ЭтоИсключение КАК ЭтоИсключение,
	|	СтарыеЗаписи.УсловиеПрименения КАК УсловиеПрименения,
	|	СтарыеЗаписи.ДатаОкончания КАК ДатаОкончания,
	|	СтарыеЗаписи.Комментарий КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтарыеЗаписи.ПравилоЗаполнения) КАК ПравилоЗаполненияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтарыеЗаписи.ОбъектСистемы) КАК ОбъектСистемыПредставление
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК СтарыеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов КАК НовыеЗаписи
	|		ПО СтарыеЗаписи.Период = НовыеЗаписи.Период
	|			И СтарыеЗаписи.ПравилоЗаполнения = НовыеЗаписи.ПравилоЗаполнения
	|			И СтарыеЗаписи.ОбъектСистемы = НовыеЗаписи.ОбъектСистемы
	|			И СтарыеЗаписи.ЭтоИсключение = НовыеЗаписи.ЭтоИсключение
	|			И СтарыеЗаписи.УсловиеПрименения = НовыеЗаписи.УсловиеПрименения
	|ГДЕ
	|	НовыеЗаписи.ПравилоЗаполнения ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписей = РегистрыСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
			НаборЗаписей.Отбор.ПравилоЗаполнения.Установить(Выборка.ПравилоЗаполнения);
			НаборЗаписей.Отбор.УсловиеПрименения.Установить(Выборка.УсловиеПрименения);
			НаборЗаписей.Отбор.ЭтоИсключение.Установить(Выборка.ЭтоИсключение);
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
						
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПредставлениеЗаписи = НСтр("ru = '%1, %2 от %3'");
			ПредставлениеЗаписи = СтрШаблон(ПредставлениеЗаписи, Выборка.ПравилоЗаполненияПредставление, 
									Выборка.ОбъектСистемыПредставление, Формат(Выборка.Период, "ДЛФ=D"));
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать запись: %1 по причине:
									|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеЗаписи, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов,, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти

#КонецЕсли
